In [2]:
import pandas as pd

In [3]:
salarayDF = pd.DataFrame([['NATHANIEL FORD','GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY',167411.18,567595.43],
                          ['GARY JIMENEZ','CAPTAIN III POLICE DEPARTMENT',155966.02,538909.28],
                          ['ALBERT PARDINI','WIRE ROPE CABLE MAINTENANCE MECHANIC',134401.6,316285.74],
                          ['SEBASTIAN WONG','DEPARTMENT HEAD V',254027.63,257124.44]
                         ],
                         ['A','B','C','D'],['EmployeeName','JobTitle','BasePay','TotalPay'])

In [4]:
salarayDF

,EmployeeName,JobTitle,BasePay,TotalPay
A,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,567595.43
B,GARY JIMENEZ,CAPTAIN III POLICE DEPARTMENT,155966.02,538909.28
C,ALBERT PARDINI,WIRE ROPE CABLE MAINTENANCE MECHANIC,134401.60,316285.74
D,SEBASTIAN WONG,DEPARTMENT HEAD V,254027.63,257124.44

In [5]:
salarayDF[salarayDF['EmployeeName'] =='GARY JIMENEZ']

   EmployeeName                       JobTitle    BasePay   TotalPay
B  GARY JIMENEZ  CAPTAIN III POLICE DEPARTMENT  155966.02  538909.28

In [6]:
salarayDF[salarayDF['EmployeeName'] =='GARY JIMENEZ']['TotalPay']

B    538909.28
Name: TotalPay, dtype: float64